cf_billing/InformationRegisters/энргСрокиЭтаповПИД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСрокиЭтаповПИД</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСхемыПИД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Юридическая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подэтап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/бестЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестЮрФизЛицо</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицоНеРезидент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Catalogs/энргВидыОперацийПИД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргВидыОперацийПИД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыЭтапов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргРоли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьПодэтапы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подэтапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подэтап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параллельно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргСхемыПИД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргСхемыПИД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СхемаОРП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банкротство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеЗадолженности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияДебитора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестКатегорииДебитора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Необязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/InformationRegisters/энргСрокиЭтаповПИД/Forms/НастройкаЭтаповОрганизации/Ext/Form/Module.bsl
&НаКлиенте
Перем мСхема;

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ЭтапыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СхемаПриИзменении(Элемент)
	Если мСхема <> Схема Тогда
	
		Если Этапы.Количество() = 0 Тогда
			мСхема = Схема;
			ЗагрузитьЭтапыСхемы();
		Иначе
			ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаответаНаОчистку", ЭтотОбъект), "Очистить таблицу ""Этапы""?", РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	мСхема = Схема;
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период = ТекущаяДатаСеанса();
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "Организация, Район, Схема, Юридическая");

	Если ЗначениеЗаполнено(Схема) Тогда
		ЗагрузитьЭтапыСхемы();
		Модифицированность = Ложь;
	КонецЕсли;
	
	ТипСхемы = ?(Юридическая, ПредопределенноеЗначение("Перечисление.бестЮрФизЛицо.ЮрЛицо"), ПредопределенноеЗначение("Перечисление.бестЮрФизЛицо.ФизЛицо"));
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("Обновить");
КонецПроцедуры

&НаКлиенте
Процедура ИзмененыДанные(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Модифицированность Тогда
	
		Отказ = Истина;
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаответаПриЗакрытии", ЭтотОбъект), "Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаответаПриЗакрытии(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		Если ЗаписатьНаСервере() Тогда 
			Закрыть();
		КонецЕсли;
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда 
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТипСхемыПриИзменении(Элемент)
	Юридическая = ТипСхемы = ПредопределенноеЗначение("Перечисление.бестЮрФизЛицо.ЮрЛицо");
	
	ОбновитьВидимостьЭлементов();
	ЗагрузитьЭтапыСхемы();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКоманд
&НаКлиенте
Процедура Сохранить(Команда)
	Если Не (ЗначениеЗаполнено(Период) И ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(Схема)) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Есть незаполненные поля");
	КонецЕсли;
	ЗаписатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭтапы(Команда)
	ЗагрузитьЭтапыСхемы();
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеМетоды
&НаКлиенте
Процедура ОбработкаответаНаОчистку(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		мСхема = Схема;
		ЗагрузитьЭтапыСхемы();
	Иначе
		Схема = мСхема;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЭтапыСхемы()

	Модифицированность = Истина;
	Этапы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСхемыПИДЭтапы.Этап КАК Этап,
		|	ЕСТЬNULL(СрокиЭтаповПИДСрезПоследних.Срок, 0) КАК Срок,
		|	ЕСТЬNULL(энргВидыОперацийПИДПодэтапы.Подэтап, ЗНАЧЕНИЕ(Справочник.энргВидыОперацийПИД.ПУСТАЯССЫЛКА)) КАК Подэтап
		|ИЗ
		|	Справочник.энргСхемыПИД.Этапы КАК энргСхемыПИДЭтапы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыОперацийПИД.Подэтапы КАК энргВидыОперацийПИДПодэтапы
		|		ПО энргСхемыПИДЭтапы.Этап = энргВидыОперацийПИДПодэтапы.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргСрокиЭтаповПИД.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Район = &Район
		|					И Схема = &Схема
		|					И Юридическая = &Юридическая) КАК СрокиЭтаповПИДСрезПоследних
		|		ПО энргСхемыПИДЭтапы.Этап = СрокиЭтаповПИДСрезПоследних.Этап
		|			И (ЕСТЬNULL(энргВидыОперацийПИДПодэтапы.Подэтап, ЗНАЧЕНИЕ(Справочник.энргВидыОперацийПИД.ПУСТАЯССЫЛКА)) = СрокиЭтаповПИДСрезПоследних.Подэтап)
		|ГДЕ
		|	энргСхемыПИДЭтапы.Ссылка = &Схема
		|
		|УПОРЯДОЧИТЬ ПО
		|	энргСхемыПИДЭтапы.НомерСтроки,
		|	ЕСТЬNULL(энргВидыОперацийПИДПодэтапы.НомерСтроки, 0)";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период",		 Новый Граница(Период, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Район",		 Район);
	Запрос.УстановитьПараметр("Схема",		 Схема);
	Запрос.УстановитьПараметр("Юридическая", Юридическая);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТЗ = Этапы.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗ, Выборка);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ЗаписатьНаСервере()
	НаборЗаписей = РегистрыСведений.энргСрокиЭтаповПИД.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Отбор.Схема.Установить(Схема);
	НаборЗаписей.Отбор.Район.Установить(Район);

	Для каждого СтрокаЭтап Из Этапы Цикл
		СтрокаРС = НаборЗаписей.Добавить();
		СтрокаРС.Период		 = Период;
		СтрокаРС.Организация = Организация;
		СтрокаРС.Схема		 = Схема;
		СтрокаРС.Район		 = Район;
		СтрокаРС.Абонент	 = Абонент;
		СтрокаРС.МКД		 = МКД;
		СтрокаРС.Услуга		 = Услуга;
		ЗаполнитьЗначенияСвойств(СтрокаРС, СтрокаЭтап);
	КонецЦикла;
	
	Попытка
		НаборЗаписей.Записать(Истина);
		Модифицированность = Ложь;
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()
	Элементы.МКД.Видимость		= Не Юридическая;
	Элементы.Услуга.Видимость	= Не Юридическая;
	Элементы.Абонент.Видимость	= Не Юридическая;
КонецПроцедуры
#КонецОбласти
